#include "Buzzer.h"                  // 
#include "Delay.h"
#include "LED.h"

/*******************************************************************************  
*
* 函 数 名: void Buzzer_Init(void)
* 功能描述: 蜂蜜器端口初始化  PB9为驱动端口
* 函数说明: 
* 调用函数: v
* 全局变量: 
* 输    入: 无
* 返    回: 
* 设 计 者：Pirate1865               日期：20240319
* 修 改 者：                         日期：
* 版    本：
*
********************************************************************************/
void Buzzer_Init(void)
{

		GPIO_InitTypeDef GPIO_InitStructure;                          //声明一个结构体变量
		RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOB,ENABLE);          //选择PB口外设时钟
	
		GPIO_InitStructure.GPIO_Mode=GPIO_Mode_Out_PP;                //GPIO模式，赋值为推挽输出模式
		GPIO_InitStructure.GPIO_Pin=GPIO_Pin_9;                       //GPIO引脚，赋值为所有PB9
		GPIO_InitStructure.GPIO_Speed=GPIO_Speed_50MHz;	              //GPIO速度，赋值为50MHz
		GPIO_Init(GPIOB,&GPIO_InitStructure);                         //将赋值后的构体变量传递给GPIO_Init函数
	                                                                //函数内部会自动根据结构体的参数配置相应寄存器
	
	/*设置GPIO初始化后的默认电平*/
	 GPIO_ResetBits(GPIOB, GPIO_Pin_9);				                      //设置PB9引脚为低电平
}

/*******************************************************************************  
*
* 函 数 名:void Buzzer_ON(void)
* 功能描述: 蜂蜜器打开
* 函数说明: 
* 调用函数: v
* 全局变量: 
* 输    入: 无
* 返    回: 
* 设 计 者：Pirate1865               日期：20240319
* 修 改 者：                         日期：
* 版    本：
*
********************************************************************************/
void Buzzer_ON(void)
{
	GPIO_SetBits(GPIOB, GPIO_Pin_9);		//设置PB1引脚为低电平
}

/*******************************************************************************  
*
* 函 数 名:void Buzzer_OFF(void)
* 功能描述: 蜂蜜器关闭
* 函数说明: 
* 调用函数: v
* 全局变量: 
* 输    入: 无
* 返    回: 
* 设 计 者：Pirate1865               日期：20240319
* 修 改 者：                         日期：
* 版    本：
*
********************************************************************************/
void Buzzer_OFF(void)
{
	GPIO_ResetBits(GPIOB, GPIO_Pin_9);		                  //设置PB9引脚为低电平
}

/**
  * 函    数：LED1状态翻转
  * 参    数：无
  * 返 回 值：无
  */

/*******************************************************************************  
*
* 函 数 名: void Buzzer_Turn(void)
* 功能描述: 蜂蜜器断续鸣叫
* 函数说明: 
* 调用函数: v
* 全局变量: 
* 输    入: 无
* 返    回: 
* 设 计 者：Pirate1865               日期：20240319
* 修 改 者：                         日期：
* 版    本：
*
********************************************************************************/
void Buzzer_Turn01(void)
{
		Buzzer_ON();
    Delay_us(300);
		Buzzer_OFF();
	  Delay_us(300);
}

void Buzzer_Turn02(void)
{
		Buzzer_ON();
    Delay_us(100);
		Buzzer_OFF();
	  Delay_us(100);
}


void love_world(uc16 music[]){
 
    u16 i,e;
 
    for (i=1;i<248;i++){
 
        for(e=0;e<music[i*2]*music[i*2+1]/1000;e++){
 
            GPIO_WriteBit(BUZZERPORT,BUZZER,(BitAction)(1));
 
            Delay_us(500000/music[i*2]);
 
            GPIO_WriteBit(BUZZERPORT,BUZZER,(BitAction)(0));
 
            Delay_us(500000/music[i*2]);
        }

    }
 
    for (i=1;i<208;i++){
 
        for(e=0;e<music[i*2]*music[i*2+1]/1000;e++){
 
            GPIO_WriteBit(BUZZERPORT,BUZZER,(BitAction)(1));
 
            Delay_us(500000/music[i*2]);
 
            GPIO_WriteBit(BUZZERPORT,BUZZER,(BitAction)(0));
 
            Delay_us(500000/music[i*2]);
 
        }
    }
 
    for (i=249;i<435;i++){
 
        for(e=0;e<music[i*2]*music[i*2+1]/1000;e++){
 
            GPIO_WriteBit(BUZZERPORT,BUZZER,(BitAction)(1));
 
            Delay_us(500000/music[i*2]);
 
            GPIO_WriteBit(BUZZERPORT,BUZZER,(BitAction)(0));
 
            Delay_us(500000/music[i*2]);
 
        }

    }
 
}

uc16 love_the_world[870]={
 
    m5  ,   400 ,  
 
    m3  ,   200 ,  
 
    h1  ,   400 ,  
 
    m5  ,   400 ,  
 
    m3  ,   200 ,  
 
    m6  ,   400 ,  
 
    m5  ,   400 ,  
 
    h2  ,   800 ,  
 
    h1  ,   400 ,  
 
    m5  ,   200 ,  
 
    h3  ,   400 ,  
 
    h1  ,   400 ,  
 
    m5  ,   200 ,  
 
    h3  ,   400 ,  
 
    h1  ,   400 ,  
 
    m5  ,   800 ,  
 
    m5  ,   400 ,  
 
    m3  ,   200 ,  
 
    h1  ,   400 ,  
 
    m5  ,   400 ,  
 
    m3  ,   200 ,  
 
    m6  ,   400 ,  
 
    m5  ,   400 ,  
 
    h2  ,   800 ,  
 
    h1  ,   400 ,  
 
    m5  ,   200 ,  
 
    h3  ,   400 ,  
 
    h1  ,   400 ,  
 
    m5  ,   200 ,  
 
    h3  ,   400 ,  
 
    h1  ,   400 ,  
 
    m5  ,   800 ,  
 
    m5  ,   200 ,  
 
    l5  ,   200 ,  
 
    l6  ,   200 ,  
 
    m1  ,   400 ,  
 
    m1  ,   400 ,  
 
    l5  ,   200 ,  
 
    l6  ,   200 ,  
 
    m1  ,   400 ,  
 
    m1  ,   400 ,  
 
    l5  ,   200 ,  
 
    l6  ,   200 ,  
 
    m1  ,   400 ,  
 
    m1  ,   800 ,  
 
    1   ,   600 ,  
 
    m1  ,   200 ,  
 
    m2  ,   200 ,  
 
    m1  ,   400 ,  
 
    m3  ,   600 ,  
 
    m1  ,   400 ,  
 
    m3  ,   1200,  
 
    m2  ,   200 ,
 
    m4  ,   600 ,  
 
    m3  ,   400 ,  
 
    m2  ,   400 ,  
 
    l7  ,   200 ,  
 
    m1  ,   200 ,  
 
    m1  ,   3200,  
 
    l5  ,   200 ,  
 
    l6  ,   200 ,  
 
    m1  ,   400 ,  
 
    m1  ,   400 ,  
 
    l5  ,   200 ,  
 
    l6  ,   200 ,  
 
    m1  ,   400 ,  
 
    m1  ,   400 ,  
 
    l5  ,   200 ,  
 
    l6  ,   200 ,  
 
    m1  ,   400 ,  
 
    m1  ,   800 ,  
 
    1   ,   600 ,  
 
    m1  ,   200 ,  
 
    m2  ,   200 ,  
 
    m1  ,   400 ,  
 
    m3  ,   600 ,  
 
    m1  ,   400 ,  
 
    m3  ,   1200,  
 
    m2  ,   200 ,  
 
    m4  ,   600 ,  
 
    m3  ,   400 ,  
 
    m2  ,   400 ,  
 
    l7  ,   200 ,  
 
    m1  ,   3400,  
 
    m5  ,   200 ,
 
    m3  ,   200 ,  
 
    m3  ,   200 ,  
 
    m2  ,   200 ,  
 
    m2  ,   400 ,  
 
    m5  ,   200 ,  
 
    m3  ,   200 ,  
 
    m3  ,   200 ,  
 
    m2  ,   200 ,  
 
    m2  ,   400 ,  
 
    m5  ,   200 ,  
 
    m3  ,   200 ,  
 
    m3  ,   200 ,  
 
    m1  ,   200 ,  
 
    m1  ,   1200,  
 
    m1  ,   200 ,  
 
    m2  ,   200 ,  
 
    m3  ,   400 ,  
 
    m2  ,   400 ,  
 
    m1  ,   200 ,  
 
    l7  ,   200 ,  
 
    m1  ,   800 ,  
 
    l5  ,   200 ,  
 
    l6  ,   200 ,  
 
    m1  ,   400 ,  
 
    m3  ,   400 ,  
 
    m2  ,   400 ,  
 
    m1  ,   200 ,  
 
    m4  ,   200 ,  
 
    m4  ,   200 ,  
 
    m3  ,   200 ,  
 
    m3  ,   400 ,  
 
    m3  ,   800 ,  
 
    m2  ,   400 ,  
 
    m2  ,   400 ,  
 
    m1  ,   200 ,  
 
    l5  ,   200 ,  
 
    l5  ,   1200,  
 
    l5  ,   200 ,  
 
    m3  ,   200 ,  
 
    m3  ,   200 ,  
 
    m2  ,   200 ,  
 
    m2  ,   400 ,  
 
    m5  ,   200 ,  
 
    m3  ,   200 ,  
 
    m3  ,   200 ,  
 
    m2  ,   200 ,  
 
    m2  ,   400 ,  
 
    m5  ,   200 ,  
 
    m3  ,   200 ,  
 
    m3  ,   200 ,  
 
    m1  ,   200 ,  
 
    m1  ,   1200,  
 
    m1  ,   200 ,  
 
    m2  ,   200 ,  
 
    m3  ,   400 ,  
 
    m2  ,   400 ,  
 
    m1  ,   200 ,  
 
    l7  ,   200 ,  
 
    m1  ,   800 ,  
 
    l5  ,   200 ,  
 
    l6  ,   200 ,  
 
    m1  ,   400 ,  
 
    m3  ,   400 ,  
 
    m2  ,   400 ,  
 
    1   ,   400 ,  
 
    1   ,   800 ,  
 
    m5  ,   800 ,  
 
    m5  ,   800 ,  
 
    m3  ,   400 ,  
 
    m5  ,   400 ,  
 
    m7  ,   400 ,  
 
    h1  ,   400 ,  
 
    h1  ,   400 ,  
 
    m5  ,   400 ,  
 
    m3  ,   400 ,  
 
    m1  ,   400 ,  
 
    l7  ,   400 ,  
 
    m1  ,   400 ,  
 
    m2  ,   400 ,  
 
    m3  ,   400 ,  
 
    m3  ,   400 ,  
 
    m5  ,   400 ,  
 
    m3  ,   400 ,  
 
    m1  ,   400 ,  
 
    m1  ,   400 ,  
 
    l5  ,   400 ,  
 
    m3  ,   400 ,  
 
    m2  ,   400 ,  
 
    m2  ,   400 ,  
 
    l5  ,   400 ,  
 
    m4  ,   400 ,  
 
    m3  ,   400 ,  
 
    m3  ,   400 ,  
 
    m2  ,   400 ,  
 
    m6  ,   400 ,  
 
    m5  ,   200 ,  
 
    m6  ,   200 ,  
 
    m6  ,   200 ,  
 
    m5  ,   600 ,  
 
    m5  ,   800 ,  
 
    m3  ,   400 ,  
 
    m5  ,   400 ,  
 
    m7  ,   400 ,  
 
    h1  ,   400 ,  
 
    h1  ,   400 ,  
 
    m5  ,   400 ,  
 
    m3  ,   400 ,  
 
    m1  ,   400 ,  
 
    l7  ,   400 ,  
 
    m1  ,   400 ,  
 
    m2  ,   400 ,  
 
    m3  ,   400 ,  
 
    m3  ,   400 ,  
 
    m5  ,   400 ,  
 
    m3  ,   400 ,  
 
    m1  ,   400 ,  
 
    m1  ,   400 ,  
 
    l5  ,   400 ,  
 
    m3  ,   400 ,  
 
    m2  ,   200 ,  
 
    m3  ,   400 ,  
 
    m2  ,   1200,  
 
    m1  ,   400 ,   //end 208 416
 
    m1  ,   800 ,  
 
    m1  ,   800 ,  
 
    m1  ,   800 ,  
 
    m1  ,   800 ,  
 
    l6  ,   400 ,  
 
    m2  ,   200 ,  
 
    m3  ,   200 ,  
 
    m5  ,   200 ,  
 
    m6  ,   200 ,  
 
    h1  ,   200 ,  
 
    h2  ,   200 ,  
 
    h3  ,   400 ,  
 
    h1  ,   400 ,  
 
    h3  ,   800 ,  
 
    l4  ,   400 ,  
 
    m5  ,   200 ,  
 
    m6  ,   200 ,  
 
    h1  ,   200 ,  
 
    h2  ,   200 ,  
 
    h3  ,   200 ,  
 
    h1  ,   200 ,  
 
    h1  ,   200 ,  
 
    h2  ,   200 ,  
 
    h2  ,   200 ,  
 
    h3  ,   200 ,  
 
    h5  ,   200 ,  
 
    h3  ,   200 ,  
 
    h2  ,   200 ,  
 
    h1  ,   200 ,  
 
    l6  ,   400 ,  
 
    m2  ,   200 ,  
 
    m3  ,   200 ,  
 
    m5  ,   200 ,  
 
    m6  ,   200 ,  
 
    h1  ,   200 ,  
 
    h2  ,   200 ,  
 
    h3  ,   400 ,  
 
    h1  ,   400 ,  
 
    h5  ,   400 ,  
 
    h3  ,   400 ,   //结束1 248 496
 
    m5  ,   3200,  
 
    m5  ,   1200,  
 
    m6  ,   200 ,  
 
    m5  ,   200 ,  
 
    m5  ,   400 ,  
 
    m3  ,   400 ,  
 
    m2  ,   400 ,  
 
    m4  ,   200 ,  
 
    m3  ,   200 ,  
 
    m3  ,   800 ,  
 
    m3  ,   800 ,  
 
    m3  ,   800 ,  
 
    m3  ,   800 ,  
 
    m3  ,   800 ,  
 
    m3  ,   800 ,  
 
    m3  ,   800 ,  
 
    1   ,   400 ,  
 
    m1  ,   400 ,  
 
    m5  ,   800 ,  
 
    m5  ,   800 ,  
 
    m5  ,   800 ,  
 
    m5  ,   800 ,  
 
    m5  ,   1200,  
 
    m6  ,   200 ,  
 
    m5  ,   200 ,  
 
    m5  ,   400 ,  
 
    m3  ,   400 ,  
 
    m2  ,   400 ,  
 
    m4  ,   200 ,  
 
    m3  ,   200 ,  
 
    m3  ,   1200,  
 
    m2  ,   200 ,  
 
    m3  ,   200 ,  
 
    m3  ,   1200,  
 
    m2  ,   200 ,  
 
    m3  ,   200 ,  
 
    m3  ,   200 ,  
 
    m2  ,   600 ,  
 
    m2  ,   800 ,  
 
    m2  ,   800 ,  
 
    m2  ,   800 ,  
 
    1   ,   800 ,  
 
    1   ,   800 ,  
 
    1   ,   800 ,  
 
    1   ,   800 ,  
 
    m3  ,   400 ,  
 
    m5  ,   400 ,  
 
    m7  ,   400 ,  
 
    h1  ,   400 ,  
 
    h1  ,   400 ,  
 
    m5  ,   400 ,  
 
    m3  ,   400 ,  
 
    l7  ,   400 ,  
 
    m1  ,   400 ,  
 
    m2  ,   400 ,  
 
    m3  ,   400 ,  
 
    m3  ,   400 ,  
 
    m5  ,   400 ,  
 
    m3  ,   400 ,  
 
    m1  ,   400 ,  
 
    m1  ,   400 ,  
 
    l5  ,   400 ,  
 
    m3  ,   400 ,  
 
    m2  ,   400 ,  
 
    m2  ,   400 ,  
 
    l5  ,   400 ,  
 
    m4  ,   800 ,  
 
    m3  ,   800 ,  
 
    m3  ,   800 ,  
 
    m3  ,   800 ,  
 
    1   ,   400 ,  
 
    m1  ,   400 ,  
 
    m3  ,   400 ,  
 
    m5  ,   400 ,  
 
    m7  ,   400 ,  
 
    h1  ,   400 ,  
 
    h1  ,   400 ,  
 
    m5  ,   400 ,  
 
    m3  ,   400 ,  
 
    m1  ,   400 ,  
 
    l7  ,   400 ,  
 
    m1  ,   400 ,  
 
    m2  ,   400 ,  
 
    m3  ,   400 ,  
 
    m3  ,   400 ,  
 
    m5  ,   400 ,  
 
    m3  ,   400 ,  
 
    m1  ,   400 ,  
 
    m1  ,   400 ,  
 
    l5  ,   400 ,  
 
    m3  ,   400 ,  
 
    m2  ,   400 ,  
 
    m2  ,   400 ,  
 
    l5  ,   400 ,  
 
    m4  ,   400 ,  
 
    m3  ,   400 ,  
 
    m3  ,   400 ,  
 
    m2  ,   400 ,  
 
    m6  ,   400 ,  
 
    m5  ,   200 ,  
 
    m6  ,   200 ,  
 
    m6  ,   200 ,  
 
    m5  ,   600 ,  
 
    m5  ,   800 ,  
 
    m3  ,   400 ,  
 
    m5  ,   400 ,  
 
    m7  ,   400 ,  
 
    h1  ,   400 ,  
 
    h1  ,   400 ,  
 
    m5  ,   400 ,  
 
    m3  ,   400 ,  
 
    m1  ,   400 ,  
 
    l7  ,   400 ,  
 
    m1  ,   400 ,  
 
    m2  ,   400 ,  
 
    m3  ,   400 ,  
 
    m3  ,   400 ,  
 
    m5  ,   400 ,  
 
    m3  ,   400 ,  
 
    m1  ,   400 ,  
 
    m1  ,   400 ,  
 
    l5  ,   400 ,  
 
    m3  ,   400 ,  
 
    m2  ,   400 ,  
 
    m2  ,   1200,  
 
    m1  ,   400 ,  
 
    m5  ,   800 ,  
 
    m5  ,   800 ,  
 
    m5  ,   800 ,  
 
    m5  ,   800 ,  
 
    m3  ,   800 ,  
 
    m3  ,   800 ,  
 
    m3  ,   800 ,  
 
    m3  ,   800 ,  
 
    m3  ,   800 ,  
 
    m3  ,   800 ,  
 
    h1  ,   400 ,  
 
    m7  ,   400 ,  
 
    m6  ,   400 ,  
 
    m5  ,   400 ,  
 
    m3  ,   800 ,  
 
    m3  ,   800 ,  
 
    m7  ,   800 ,  
 
    h1  ,   800 ,  
 
    m5  ,   800 ,  
 
    m5  ,   800 ,  
 
    h1  ,   400 ,  
 
    h7  ,   400 ,  
 
    h6  ,   400 ,  
 
    h5  ,   400 ,  
 
    h3  ,   800 ,  
 
    h3  ,   800 ,  
 
    m7  ,   800 ,  
 
    h1  ,   800 ,  
 
    m5  ,   800 ,  
 
    m5  ,   800 ,  
 
    h1  ,   400 ,  
 
    h7  ,   400 ,  
 
    h6  ,   400 ,  
 
    h5  ,   400 ,  
 
    1   ,   800 ,  
 
    1   ,   800 ,  
 
    1   ,   800 ,  
 
    1   ,   800 ,  
 
    l5  ,   200 ,  
 
    l6  ,   200 ,  
 
    m1  ,   400 ,  
 
    m1  ,   400 ,  
 
    l5  ,   200 ,  
 
    l6  ,   200 ,  
 
    m1  ,   400 ,  
 
    m1  ,   400 ,  
 
    l5  ,   200 ,  
 
    l6  ,   200 ,  
 
    m1  ,   400 ,  
 
    m1  ,   3200,  
 
    l5  ,   200 ,  
 
    l6  ,   200 ,  
 
    m1  ,   400 ,  
 
    m1  ,   400 ,  
 
    l5  ,   200 ,  
 
    l6  ,   200 ,  
 
    m1  ,   400 ,  
 
    m1  ,   400 ,  
 
    l5  ,   200 ,  
 
    l6  ,   600 ,  
 
    m1  ,   3200    //435 870  
 
};

uc16 music1[22]=
{
 
/*一组为一拍，一道下划线为1/2拍，两道下划线为1/4拍*/
/*上点为重音，下点为低音*/
 
    l5,200,
 
    l6,200,
 
    m1,400,
 
    m1,400,
 
    l5,200,
 
    l6,200,
 
    m1,400 ,
 
    m1,400,
    
    l5,200,
 
    l6,200,
 
    m1,400 
};








uc16 SONG_TONE[]=
{212,212,190,212,159,169,212,212,190,212,142,159,
212,212,106,126,159,169,190,119,119,126,159,142,159,0}; //声调

uc16 SONG_LONG[]=
{9,3,12,12,12,24,9,3,12,12,12,24,                       //节拍
9,3,12,12,12,12,12,9,3,12,12,12,24,0};



//控制音频、节拍函数
void HappyBirthday(void)
{
		u16 i=0,j,k;
		while(SONG_LONG[i]!=0||SONG_TONE[i]!=0)
		{   
				for(j=0;j<SONG_LONG[i]*80;j++)  //播放各个音符，SONG_LONG 为拍子长度
				{
						Buzzer_TOGGLE;
						for(k=0;k<SONG_TONE[i]*10;k++);//SONG_TONE 延时表决定了每个音符的频率
				}
				Delay_ms(10);
				i++;
		}
 
}

//用枚举定义，记录所有的音频。
enum  Low_frequency{l_dao=262,l_re=286,l_mi=311,l_fa=349,l_sao=392,l_la=440,l_xi=494};
enum  Normal_frequency{dao=523,re=587,mi=659,fa=698,sao=784,la=880,xi=987};
enum  High_frequency{h_dao=1046,h_re=1174,h_mi=1318,h_fa=1396,h_sao=1567,h_la=1760,h_xi=1975};

//以下是《渴望》片头曲的一段简谱“好人一生平安”
uc16 f[]=
{
    re,mi,re,dao,l_la,dao,l_la,//每行对应一小节音调
    l_sao,l_mi,l_sao,l_la,dao,
    l_la,dao,sao,la,mi,sao,
    re,
    mi,re,mi,sao,mi,
    l_sao,l_mi,l_sao,l_la,dao,
    l_la,l_la,dao,l_la,l_sao,l_re,l_mi,
    l_sao,
    re,re,sao,la,sao,
    fa,mi,sao,mi,
    la,sao,mi,re,mi,l_la,dao,
    re,
    mi,re,mi,sao,mi,
    l_sao,l_mi,l_sao,l_la,dao,
    l_la,dao,re,l_la,dao,re,mi,
    re,
    l_la,dao,re,l_la,dao,re,mi,
    re,
    0xff
};//以0xff作为音调的结束标志
//以下是简谱中每个音调的节拍
//“4”对应4个延时单位,“2”对应两个延时单位,“1”对应1个延时单位
uc16 JP[]=
{
    4,1,1,4,1,1,2,//每行对应一小节音调的节拍
    2,2,2,2,8,
    4,2,3,1,2,2,
    10,
    4,2,2,4,4,
    2,2,2,2,4,
    2,2,2,2,2,2,2,
    10,
    4,4,4,2,2,
    4,2,4,4,
    4,2,2,2,2,2,2,
    10,
    4,2,2,4,4,
    2,2,2,2,6,
    4,2,2,4,1,1,4,
    10,
    4,2,2,4,1,1,4,
    10
};


//控制音频、节拍函数
void Disirer(void)
{
		u16 i=0,j,k;
		while(f[i]!=0xFF)
		{   
				for(j=0;j<JP[i]*300;j++)  //播放各个音符，JP 为拍子长度
				{
						Buzzer_TOGGLE;
						for(k=0;k<f[i]*5;k++);//F延时表决定了每个音符的频率
				}
				Delay_ms(10);
				i++;
		}
 
}


